## Terraform Plan 📋

<details><summary>Click to expand plan output</summary>

```hcl
module.compute_us_east_1.module.lambda_greeter.data.external.archive_prepare[0]: Reading...
module.compute_eu_west_1.module.lambda_dispatcher.data.external.archive_prepare[0]: Reading...
module.compute_eu_west_1.module.lambda_greeter.data.external.archive_prepare[0]: Reading...
module.compute_us_east_1.module.lambda_dispatcher.data.external.archive_prepare[0]: Reading...
module.compute_us_east_1.module.lambda_greeter.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.compute_eu_west_1.module.lambda_dispatcher.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.compute_eu_west_1.module.lambda_greeter.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.compute_us_east_1.module.lambda_dispatcher.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.compute_us_east_1.module.ecs_execution_role.data.aws_partition.current: Reading...
module.compute_us_east_1.module.ecs_execution_role.data.aws_caller_identity.current: Reading...
module.compute_us_east_1.module.ecs_execution_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.module.ecs_cluster.data.aws_region.current[0]: Reading...
module.compute_us_east_1.module.lambda_greeter.data.aws_region.current: Reading...
module.compute_eu_west_1.module.vpc.data.aws_region.current[0]: Reading...
module.compute_us_east_1.module.ecs_cluster.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_partition.current: Reading...
module.compute_eu_west_1.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=eu-west-1]
module.compute_us_east_1.module.lambda_greeter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.lambda_dispatcher.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.compute_eu_west_1.module.ecs_cluster.data.aws_partition.current[0]: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_iam_policy_document.inline[0]: Reading...
module.compute_us_east_1.module.lambda_dispatcher.data.aws_region.current: Reading...
module.compute_us_east_1.module.ecs_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=003767002475]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.compute_us_east_1.data.aws_availability_zones.available: Reading...
module.compute_eu_west_1.module.ecs_cluster.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.compute_us_east_1.module.ecs_task_role.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_iam_policy_document.inline[0]: Read complete after 0s [id=2822585868]
module.compute_us_east_1.module.ecs_task_role.data.aws_iam_policy_document.inline[0]: Reading...
module.compute_us_east_1.module.ecs_task_role.data.aws_iam_policy_document.inline[0]: Read complete after 0s [id=2822585868]
module.compute_eu_west_1.module.lambda_greeter.data.aws_caller_identity.current: Reading...
module.compute_us_east_1.module.ecs_task_role.data.aws_partition.current: Reading...
module.compute_us_east_1.module.ecs_task_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=003767002475]
module.compute_eu_west_1.module.ecs_task_role.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.ecs_cluster.data.aws_region.current[0]: Reading...
module.compute_eu_west_1.module.ecs_cluster.data.aws_region.current[0]: Read complete after 0s [id=eu-west-1]
module.compute_eu_west_1.module.ecs_execution_role.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.lambda_greeter.data.aws_partition.current: Reading...
module.compute_eu_west_1.module.lambda_greeter.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_eu_west_1.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.compute_eu_west_1.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_partition.current: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.module.ecs_cluster.data.aws_partition.current[0]: Reading...
module.compute_us_east_1.module.ecs_cluster.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.compute_us_east_1.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.compute_us_east_1.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.compute_eu_west_1.module.ecs_cluster.data.aws_caller_identity.current[0]: Reading...
module.compute_us_east_1.module.ecs_task_role.data.aws_caller_identity.current: Read complete after 0s [id=003767002475]
module.compute_eu_west_1.module.lambda_greeter.data.aws_region.current: Reading...
module.compute_eu_west_1.module.lambda_greeter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.compute_us_east_1.module.lambda_greeter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.lambda_greeter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_region.current: Reading...
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.lambda_greeter.data.aws_caller_identity.current: Read complete after 0s [id=003767002475]
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_partition.current: Reading...
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.module.lambda_greeter.data.aws_caller_identity.current: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_caller_identity.current: Read complete after 0s [id=003767002475]
module.compute_us_east_1.module.vpc.data.aws_region.current[0]: Reading...
module.compute_us_east_1.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.compute_eu_west_1.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.compute_eu_west_1.module.ecs_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=003767002475]
module.compute_eu_west_1.module.vpc.data.aws_partition.current[0]: Reading...
module.compute_eu_west_1.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.compute_eu_west_1.module.ecs_execution_role.data.aws_partition.current: Reading...
module.compute_eu_west_1.module.ecs_execution_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_eu_west_1.data.aws_availability_zones.available: Reading...
module.compute_eu_west_1.module.lambda_dispatcher.data.aws_caller_identity.current: Read complete after 1s [id=003767002475]
module.compute_us_east_1.module.lambda_dispatcher.data.aws_caller_identity.current: Read complete after 1s [id=003767002475]
module.compute_eu_west_1.module.lambda_greeter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.ecs_cluster.data.aws_caller_identity.current[0]: Reading...
module.compute_eu_west_1.module.ecs_cluster.data.aws_caller_identity.current[0]: Read complete after 1s [id=003767002475]
module.compute_eu_west_1.module.lambda_greeter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.compute_us_east_1.module.vpc.data.aws_partition.current[0]: Reading...
module.compute_us_east_1.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.compute_us_east_1.module.lambda_greeter.data.aws_caller_identity.current: Read complete after 1s [id=003767002475]
module.compute_eu_west_1.module.vpc.data.aws_caller_identity.current[0]: Read complete after 1s [id=003767002475]
module.compute_us_east_1.module.lambda_greeter.data.aws_partition.current: Reading...
module.compute_us_east_1.module.lambda_greeter.data.aws_partition.current: Read complete after 0s [id=aws]
module.compute_us_east_1.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.compute_us_east_1.module.ecs_cluster.data.aws_caller_identity.current[0]: Read complete after 0s [id=003767002475]
module.compute_us_east_1.module.ecs_execution_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.ecs_execution_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3479087837]
module.compute_us_east_1.module.ecs_task_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_eu_west_1.module.ecs_execution_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_eu_west_1.module.ecs_task_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.compute_us_east_1.module.ecs_task_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3479087837]
module.compute_eu_west_1.module.ecs_execution_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3479087837]
module.compute_eu_west_1.module.ecs_task_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3479087837]
module.compute_eu_west_1.data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cognito_user.test will be created
  + resource "aws_cognito_user" "test" {
      + attributes            = {
          + "email"          = "ahmed_qazi444@hotmail.com"
          + "email_verified" = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "us-east-1"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "ahmed_qazi444@hotmail.com"
    }

  # aws_secretsmanager_secret.cognito_password will be created
  + resource "aws_secretsmanager_secret" "cognito_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "unleash-cognito-test-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "us-east-1"
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "unleash"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.cognito_password will be created
  + resource "aws_secretsmanager_secret_version" "cognito_password" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # random_password.cognito_user will be created
  + resource "random_password" "cognito_user" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!@#$%^&*"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.cognito.aws_cognito_user_pool.pool[0] will be created
  + resource "aws_cognito_user_pool" "pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "unleash-user-pool"
      + region                     = "us-east-1"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "Project"     = "unleash"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "unleash"
        }
      + user_pool_tier             = "ESSENTIALS"

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true

          + invite_message_template {
              + email_message = "{username}, your verification code is `{####}`"
              + email_subject = "Your verification code"
              + sms_message   = "Your username is {username} and temporary password is `{####}`"
            }
        }

      + email_configuration {
          + email_sending_account  = "COGNITO_DEFAULT"
            # (2 unchanged attributes hidden)
        }

      + password_policy {
          + minimum_length                   = 12
          + password_history_size            = 0
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = false
        }

      + user_attribute_update_settings {
          + attributes_require_verification_before_update = [
              + "email",
            ]
        }

      + username_configuration (known after apply)

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_CODE"
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.cognito.aws_cognito_user_pool_client.client["unleash-client_0"] will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                         = 1
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 1
      + logout_urls                                   = (known after apply)
      + name                                          = "unleash-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 30
      + region                                        = "us-east-1"
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "hours"
          + id_token      = "hours"
          + refresh_token = "days"
        }
    }

  # module.compute_eu_west_1.aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/ecs/unleash-eu-west-1-sns-publisher"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
    }

  # module.compute_eu_west_1.aws_ecs_task_definition.sns_publisher will be created
  + resource "aws_ecs_task_definition" "sns_publisher" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "echo 'SNS skipped (send_sns=false)'",
                    ]
                  + entryPoint       = [
                      + "/bin/sh",
                      + "-c",
                    ]
                  + essential        = true
                  + image            = "amazon/aws-cli"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/unleash-eu-west-1-sns-publisher"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "sns-publisher"
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "unleash-eu-west-1-sns-publisher"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.compute_eu_west_1.aws_lambda_permission.apigw_dispatcher will be created
  + resource "aws_lambda_permission" "apigw_dispatcher" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "unleash-eu-west-1-dispatcher"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-west-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.compute_eu_west_1.aws_lambda_permission.apigw_greeter will be created
  + resource "aws_lambda_permission" "apigw_greeter" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "unleash-eu-west-1-greeter"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-west-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.compute_eu_west_1.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS Fargate tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS outbound for SNS/ECR"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "unleash-eu-west-1-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-eu-west-1-ecs-sg"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-eu-west-1-ecs-sg"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + vpc_id                 = (known after apply)
    }

  # module.compute_us_east_1.aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/ecs/unleash-us-east-1-sns-publisher"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
    }

  # module.compute_us_east_1.aws_ecs_task_definition.sns_publisher will be created
  + resource "aws_ecs_task_definition" "sns_publisher" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "echo 'SNS skipped (send_sns=false)'",
                    ]
                  + entryPoint       = [
                      + "/bin/sh",
                      + "-c",
                    ]
                  + essential        = true
                  + image            = "amazon/aws-cli"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/unleash-us-east-1-sns-publisher"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "sns-publisher"
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "unleash-us-east-1-sns-publisher"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "us-east-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.compute_us_east_1.aws_lambda_permission.apigw_dispatcher will be created
  + resource "aws_lambda_permission" "apigw_dispatcher" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "unleash-us-east-1-dispatcher"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.compute_us_east_1.aws_lambda_permission.apigw_greeter will be created
  + resource "aws_lambda_permission" "apigw_greeter" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "unleash-us-east-1-greeter"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.compute_us_east_1.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS Fargate tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS outbound for SNS/ECR"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "unleash-us-east-1-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-us-east-1-ecs-sg"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-us-east-1-ecs-sg"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + vpc_id                 = (known after apply)
    }

  # module.waf_cloudfront.aws_wafv2_web_acl.this will be created
  + resource "aws_wafv2_web_acl" "this" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "unleash-cloudfront-waf"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "unleash"
          + "Purpose"     = "cloudfront-protection"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "unleash"
          + "Purpose"     = "cloudfront-protection"
        }

      + captcha_config {
          + immunity_time_property {
              + immunity_time = 300
            }
        }

      + challenge_config {
          + immunity_time_property {
              + immunity_time = 300
            }
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "aws-managed-common"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "unleash-common-rules"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "aws-managed-known-bad-inputs"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "unleash-known-bad-inputs"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "unleash-cloudfront-waf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf_cognito.aws_wafv2_web_acl.this will be created
  + resource "aws_wafv2_web_acl" "this" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "unleash-cognito-waf"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + scope                       = "REGIONAL"
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "unleash"
          + "Purpose"     = "cognito-protection"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "unleash"
          + "Purpose"     = "cognito-protection"
        }

      + captcha_config {
          + immunity_time_property {
              + immunity_time = 300
            }
        }

      + challenge_config {
          + immunity_time_property {
              + immunity_time = 300
            }
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "aws-managed-common"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "unleash-common-rules"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "aws-managed-known-bad-inputs"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "unleash-known-bad-inputs"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "unleash-cognito-waf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf_cognito.aws_wafv2_web_acl_association.this[0] will be created
  + resource "aws_wafv2_web_acl_association" "this" {
      + id           = (known after apply)
      + region       = "us-east-1"
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Unleash Live assessment API"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "unleash-eu-west-1-api"
      + protocol_type                = "HTTP"
      + region                       = "eu-west-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }

      + cors_configuration {
          + allow_headers = [
              + "Authorization",
              + "Content-Type",
            ]
          + allow_methods = [
              + "GET",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_authorizer.this["cognito"] will be created
  + resource "aws_apigatewayv2_authorizer" "this" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "unleash-eu-west-1-cognito-auth"
      + region                           = "eu-west-1"

      + jwt_configuration {
          + audience = (known after apply)
          + issuer   = (known after apply)
        }
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_integration.this["GET /greet"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "eu-west-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_integration.this["POST /dispatch"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "eu-west-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_route.this["GET /greet"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + region             = "eu-west-1"
      + route_key          = "GET /greet"
      + target             = (known after apply)
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_route.this["POST /dispatch"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + region             = "eu-west-1"
      + route_key          = "POST /dispatch"
      + target             = (known after apply)
    }

  # module.compute_eu_west_1.module.api_gateway.aws_apigatewayv2_stage.this[0] will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "eu-west-1"
      + tags          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + context = {
                      + domainName              = "$context.domainName"
                      + error                   = {
                          + message      = "$context.error.message"
                          + responseType = "$context.error.responseType"
                        }
                      + identity                = {
                          + sourceIP = "$context.identity.sourceIp"
                        }
                      + integration             = {
                          + error             = "$context.integration.error"
                          + integrationStatus = "$context.integration.integrationStatus"
                        }
                      + integrationErrorMessage = "$context.integrationErrorMessage"
                      + protocol                = "$context.protocol"
                      + requestId               = "$context.requestId"
                      + requestTime             = "$context.requestTime"
                      + responseLength          = "$context.responseLength"
                      + routeKey                = "$context.routeKey"
                      + stage                   = "$context.stage"
                      + status                  = "$context.status"
                    }
                }
            )
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 1000
          + throttling_rate_limit    = 500
        }

      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "GET /greet"
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 50
        }
      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "POST /dispatch"
          + throttling_burst_limit   = 50
          + throttling_rate_limit    = 25
        }
    }

  # module.compute_eu_west_1.module.api_gateway.aws_cloudwatch_log_group.this["this"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/apigateway/unleash-eu-west-1-api/default"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
    }

  # module.compute_eu_west_1.module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "unleash-eu-west-1-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = false
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          + target_origin_id         = "api_gateway"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "api_gateway"
          + response_completion_timeout = (known after apply)
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
                # (1 unchanged attribute hidden)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1.2_2025"
        }
    }

  # module.compute_eu_west_1.module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "unleash-eu-west-1-GreetingLogs"
      + read_capacity    = (known after apply)
      + region           = "eu-west-1"
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-eu-west-1-GreetingLogs"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "unleash-eu-west-1-GreetingLogs"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = false
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled        = false
            # (1 unchanged attribute hidden)
        }

      + warm_throughput (known after apply)
    }

  # module.compute_eu_west_1.module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/ecs/unleash-eu-west-1-cluster"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/aws/ecs/unleash-eu-west-1-cluster"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/aws/ecs/unleash-eu-west-1-cluster"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
    }

  # module.compute_eu_west_1.module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "unleash-eu-west-1-cluster"
      + region   = "eu-west-1"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_log_group_name = "/aws/ecs/unleash-eu-west-1-cluster"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enhanced"
        }
    }

  # module.compute_eu_west_1.module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "unleash-eu-west-1-cluster"
      + id                 = (known after apply)
      + region             = "eu-west-1"

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # module.compute_eu_west_1.module.ecs_cluster.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "20s"
      + id              = (known after apply)
      + triggers        = {
          + "capacity_provider_names" = null
          + "capacity_providers"      = null
        }
    }

  # module.compute_eu_west_1.module.ecs_execution_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "unleash-eu-west-1-ecs-exec"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)

      + inline_policy (known after apply)
    }

  # module.compute_eu_west_1.module.ecs_execution_role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "unleash-eu-west-1-ecs-exec"
    }

  # module.compute_eu_west_1.module.ecs_task_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "unleash-eu-west-1-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "ahmed_qazi444"
          + "Project"     = "unleash"
        }
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)

      + inline_policy (known after apply)
    }

  # module.compute_eu_west_1.module.ecs_task_role.aws_iam_role_policy.inline[0] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "unleash-eu-west-1-ecs-task_inline_"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = ""
                      + Sid      = "SNSPublish"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "unleash-eu-west-1-ecs-task"
    }

  # module.compute_eu_west_1.module.lambda_dispatcher.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (

... (truncated)
```

</details>

*Pushed by @ahmedqazi444*